tap "derailed/k9s"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "bash"
brew "bat"
brew "btop"
brew "colima"
brew "docker"
brew "eza"
brew "fzf"
brew "go"
brew "kubecolor"
brew "kubernetes-cli"
brew "neovim"
brew "node"
brew "python@3.13"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "derailed/k9s/k9s"
cask "aerospace"
cask "ghostty"
cask "rectangle"
