brew "bash"
brew "bat"
brew "btop"
brew "colima"
brew "docker"
brew "eza"
brew "fzf"
brew "go"
brew "kubecolor"
brew "kubernetes-cli"
brew "neovim"
brew "python"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "zsh-autosuggestions"
brew "derailed/k9s/k9s"
cask "ghostty"
cask "mac-mouse-fix"
cask "rectangle"
